In [4]:
import sqlite3
db = sqlite3.connect('IMDB.sqlite')
db

In [12]:

db = sqlite3.connect('School.sqlite')
cur =db.cursor()
query = 'create table School(Roll int primary key,Name Text,Age int)'
cur.execute(query)

OperationalError: table School already exists

In [17]:
cur.execute('insert into School values(21, "Abhijit",67)')
db.commit()

IntegrityError: UNIQUE constraint failed: School.Roll

In [18]:
cur.execute('insert into School values(22, "dip",67)')
cur.execute('insert into School values(20, "ritu",67)')
db.commit()

In [19]:
db.close()

In [4]:
import sqlite3
db = sqlite3.connect('employyee_details.sqlite')

cur = db.cursor()
cur.execute('create table employyee_details(employe_id int primary key,Name Text,Age int , Department Text, Salary int)')

OperationalError: table employyee_details already exists

In [5]:
cur .execute('insert into employyee_details values(100,"Rishab",25, "Marketing" , 50000)')
db.commit()

In [6]:
cur .execute('insert into employyee_details values(101,"Abhisek",26, "Oparation" , 60000)')
cur .execute('insert into employyee_details values(102,"Aman",24, "Human Resource" , 75000)')
db.commit()

In [7]:
cur.execute('delete from employyee_details where employe_id = 101')

In [9]:
db.commit()
db.close()

In [11]:
import pandas as pd

In [14]:
db = sqlite3.connect('IMDB.sqlite')

In [38]:
data = pd.read_sql_query("select * from IMDB",db)

data.head()
data.iloc[1:,1:3]

                                 Title  Rating
1                     127 Hours (2010)     7.6
2                         50/50 (2011)     7.7
3                    About Time (2013)     7.8
4                         Amour (2012)     7.9
5                          Argo (2012)     7.7
..                                 ...     ...
112                    Whiplash (2014)     8.5
113              Wreck-It Ralph (2012)     7.7
114  X-Men: Days of Future Past (2014)     8.0
115          X-Men: First Class (2011)     7.8
116                    Zootopia (2016)     8.1

[116 rows x 2 columns]

In [52]:
data['Runtime'] = data['Runtime'].str.strip(' min')
# data['Runtime'] = data['Runtime'].astype(int)
data['Runtime'].describe()

count     117
unique     56
top
freq       21
Name: Runtime, dtype: object